[
  {
    "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
    "author": "Стив Макконнелл"
  },
  {
    "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
    "author": "Артур Блох. Законы Мэрфи"
  },
  {
    "text": "Ходить по воде и разрабатывать программы, следуя ТЗ, очень просто… если они заморожены",
    "author": "И. Берард"
  },
  {
    "text": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили",
    "author": "Закон Мошера о программной инженерии"
  },
  {
    "text": "Иногда лучше остаться в постели в понедельник, чем тратить остаток недели на отладку кода понедельника",
    "author": "Дэн Саломон"
  },
  {
    "text": "Никто в краткой истории вычислительной техники никогда не писал идеального программного обеспечения. Вряд ли ты будешь первым",
    "author": "Энди Хант"
  },
  {
    "text": "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь",
    "author": "Васим Латиф"
  },
  {
    "text": "Отладка кода — это как охота. Охота на баги",
    "author": "Амит Калантри"
  },
  {
    "text": "Любой дурак сможет написать код, который поймет машина. Хорошие программисты пишут код, который сможет понять человек",
    "author": "Мартин Фаулер"
  },
  {
    "text": "Если вы хотите, чтобы код было легко и быстро писать — делайте его удобным для чтения",
    "author": "Роберт Мартин"
  },
  {
    "text": "Работает? Не трогай",
    "author": "Любой программист"
  },
  {
    "text": "Есть всего два типа языков программирования: те, на которые люди всё время ругаются, и те, которые никто не использует",
    "author": "Бьёрн Страуструп"
  },
  {
    "text": "Нельзя доверять коду, который вы не написали полностью сами",
    "author": "Кен Томпсон"
  },
  {
    "text": "Модульность — фундаментальный аспект всех успешно работающих крупных систем",
    "author": "Бьёрн Страуструп"
  },
  {
    "text": "Есть два способа создания дизайна программы. Один из них, это сделать его настолько простым, что в нем, очевидно, не будет недостатков. Другой способ — сделать его настолько запутанным, что в нем не будет очевидных недостатков",
    "author": "Чарльз Хоар"
  }
]